Repository: moxi000/kelivo
Catalog: Kelivo-Swift/Kelivo/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# aboutPageAppDescription
source: Open-source AI Assistant
zh_hans: 开源 AI 助手
zh_hant: 開源 AI 助理

# aboutPageEasterEggButton
source: Nice!
zh_hans: 好的
zh_hant: 好的

# aboutPageEasterEggMessage
source: Thanks for exploring! (No egg yet)
zh_hans: （好吧现在还没彩蛋）
zh_hant: （好吧現在還沒彩蛋）

# aboutPageJoinDiscord
source: Join us on Discord
zh_hans: 在 Discord 中加入我们
zh_hant: 加入我們的 Discord

# aboutPageJoinQQGroup
source: Join our QQ Group
zh_hans: 加入QQ群
zh_hant: 加入 QQ 群

# aboutPageLicense
source: License
zh_hans: 许可证
zh_hant: 授權

# aboutPageNoQQGroup
source: No QQ group yet
zh_hans: 暂无QQ群
zh_hant: 暫無QQ群

# aboutPageSystem
source: System
zh_hans: 系统
zh_hant: 系統

# aboutPageVersion
source: Version
zh_hans: 版本
zh_hant: 版本

# aboutPageWebsite
source: Website
zh_hans: 官网
zh_hant: 官網

# addProviderSheetAddButton
source: Add
zh_hans: 添加
zh_hant: 新增

# addProviderSheetApiPathLabel
source: API Path
zh_hans: API 路径
zh_hant: API 路徑

# addProviderSheetCancelButton
source: Cancel
zh_hans: 取消
zh_hant: 取消

# addProviderSheetEnabledLabel
source: Enabled
zh_hans: 是否启用
zh_hant: 是否啟用

# addProviderSheetImportJsonButton
source: Import JSON
zh_hans: 导入 JSON
zh_hant: 匯入 JSON

# addProviderSheetNameLabel
source: Name
zh_hans: 名称
zh_hant: 名稱

# addProviderSheetTitle
source: Add Provider
zh_hans: 添加供应商
zh_hant: 新增供應商

# addProviderSheetVertexAiLocationLabel
source: Location
zh_hans: 位置
zh_hant: 位置

# addProviderSheetVertexAiProjectIdLabel
source: Project ID
zh_hans: 项目ID
zh_hant: 專案ID

# addProviderSheetVertexAiServiceAccountJsonLabel
source: Service Account JSON (paste or import)
zh_hans: 服务账号 JSON（粘贴或导入）
zh_hant: 服務帳號 JSON（貼上或匯入）

# androidBackgroundNotificationText
source: Keeping chat generation alive in background
zh_hans: 后台保持聊天生成
zh_hant: 後台保持聊天生成

# androidBackgroundNotificationTitle
source: Kelivo is running
zh_hans: Kelivo 正在运行
zh_hant: Kelivo 正在運行

# androidBackgroundOptionOff
source: Off
zh_hans: 关闭
zh_hant: 關閉

# androidBackgroundOptionOn
source: On
zh_hans: 开启
zh_hant: 開啟

# androidBackgroundOptionOnNotify
source: On and notify when done
zh_hans: 开启并在生成完时通知
zh_hant: 開啟並在生成完時發送消息

# androidBackgroundStatusOff
source: Off
zh_hans: 关闭
zh_hant: 關閉

# androidBackgroundStatusOn
source: On
zh_hans: 开启
zh_hant: 開啟

# androidBackgroundStatusOther
source: On and notify
zh_hans: 开启并通知
zh_hant: 關閉並發送消息

# assistantEditAddMemoryButton
source: Add Memory
zh_hans: 添加记忆
zh_hant: 新增記憶

# assistantEditAddQuickPhraseButton
source: Add Quick Phrase
zh_hans: 添加快捷短语
zh_hant: 新增快捷片語

# assistantEditAddRegexButton
source: Add Regex Rule
zh_hans: 添加正则规则
zh_hant: 新增正則規則

# assistantEditAssistantNameLabel
source: Assistant Name
zh_hans: 助手名称
zh_hant: 助理名稱

# assistantEditAvailableVariables
source: Available variables:
zh_hans: 可用变量：
zh_hant: 可用變數：

# assistantEditAvatarChooseEmoji
source: Choose Emoji
zh_hans: 选择表情
zh_hant: 選擇表情

# assistantEditAvatarChooseImage
source: Choose Image
zh_hans: 选择图片
zh_hant: 選擇圖片

# assistantEditAvatarEnterLink
source: Enter Link
zh_hans: 输入链接
zh_hant: 輸入連結

# assistantEditAvatarImportQQ
source: Import from QQ
zh_hans: QQ头像
zh_hant: QQ頭像

# assistantEditAvatarReset
source: Reset
zh_hans: 重置
zh_hant: 重設

# assistantEditBodyValueLabel
source: Body Value (JSON)
zh_hans: Body 值 (JSON)
zh_hant: Body 值 (JSON)

# assistantEditChatBackgroundDescription
source: Set a background image for this assistant
zh_hans: 设置助手聊天页面的背景图片
zh_hant: 設定助理聊天頁面的背景圖片

# assistantEditChatBackgroundTitle
source: Chat Background
zh_hans: 聊天背景
zh_hant: 聊天背景

# assistantEditChatModelSubtitle
source: Default chat model for this assistant (fallback to global)
zh_hans: 为该助手设置默认聊天模型（未设置时使用全局默认）
zh_hant: 為該助理設定預設聊天模型（未設定時使用全域預設）

# assistantEditChatModelTitle
source: Chat Model
zh_hans: 聊天模型
zh_hant: 聊天模型

# assistantEditChooseImageButton
source: Choose Image
zh_hans: 选择背景图片
zh_hant: 選擇背景圖片

# assistantEditClearButton
source: Clear
zh_hans: 清除
zh_hant: 清除

# assistantEditConfigureButton
source: Configure
zh_hans: 配置
zh_hant: 設定

# assistantEditContextMessagesDescription
source: How many recent messages to keep in context
zh_hans: 多少历史消息会被当作上下文发送给模型，超过数量会忽略，只保留最近 N 条
zh_hant: 多少歷史訊息會被當作上下文傳送給模型，超過數量會忽略，只保留最近 N 條

# assistantEditContextMessagesTitle
source: Context Messages
zh_hans: 上下文消息数量
zh_hant: 上下文訊息數量

# assistantEditCustomBodyAdd
source: Add Body
zh_hans: 添加 Body
zh_hant: 新增 Body

# assistantEditCustomBodyEmpty
source: No body items added
zh_hans: 未添加 Body 项
zh_hant: 未新增 Body 項

# assistantEditCustomBodyTitle
source: Custom Body
zh_hans: 自定义 Body
zh_hant: 自訂 Body

# assistantEditCustomHeadersAdd
source: Add Header
zh_hans: 添加 Header
zh_hant: 新增 Header

# assistantEditCustomHeadersEmpty
source: No headers added
zh_hans: 未添加 Header
zh_hant: 未新增 Header

# assistantEditCustomHeadersTitle
source: Custom Headers
zh_hans: 自定义 Header
zh_hant: 自訂 Header

# assistantEditDeleteTooltip
source: Delete
zh_hans: 删除
zh_hant: 刪除

# assistantEditEmojiDialogCancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# assistantEditEmojiDialogHint
source: Type or paste any emoji
zh_hans: 输入或粘贴任意表情
zh_hant: 輸入或貼上任意表情

# assistantEditEmojiDialogSave
source: Save
zh_hans: 保存
zh_hant: 儲存

# assistantEditEmojiDialogTitle
source: Choose Emoji
zh_hans: 选择表情
zh_hant: 選擇表情

# assistantEditGalleryErrorMessage
source: Unable to open gallery. Try entering an image URL.
zh_hans: 无法打开相册，试试输入图片链接
zh_hant: 無法開啟相簿，試試輸入圖片連結

# assistantEditGeneralErrorMessage
source: Something went wrong. Try entering an image URL.
zh_hans: 发生错误，试试输入图片链接
zh_hant: 發生錯誤，試試輸入圖片連結

# assistantEditHeaderNameLabel
source: Header Name
zh_hans: Header 名称
zh_hant: Header 名稱

# assistantEditHeaderValueLabel
source: Header Value
zh_hans: Header 值
zh_hant: Header 值

# assistantEditImageUrlDialogCancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# assistantEditImageUrlDialogHint
source: e.g. https://example.com/avatar.png
zh_hans: 例如: https://example.com/avatar.png
zh_hant: 例如: https://example.com/avatar.png

# assistantEditImageUrlDialogSave
source: Save
zh_hans: 保存
zh_hant: 儲存

# assistantEditImageUrlDialogTitle
source: Enter Image URL
zh_hans: 输入图片链接
zh_hant: 輸入圖片連結

# assistantEditManageMemoryTitle
source: Manage Memories
zh_hans: 管理记忆
zh_hant: 管理記憶

# assistantEditManageQuickPhraseButton
source: Manage Quick Phrases
zh_hans: 管理快捷短语
zh_hant: 管理快捷片語

# assistantEditMaxTokensDescription
source: Leave empty for unlimited
zh_hans: 留空表示无限制
zh_hant: 留空表示無限制

# assistantEditMaxTokensHint
source: Unlimited
zh_hans: 无限制
zh_hant: 無限制

# assistantEditMaxTokensTitle
source: Max Tokens
zh_hans: 最大 Token 数
zh_hant: 最大 Token 數

# assistantEditMcpConnectedTag
source: Connected
zh_hans: 已连接
zh_hant: 已連線

# assistantEditMcpNoServersMessage
source: No running MCP servers
zh_hans: 暂无已启动的 MCP 服务器
zh_hant: 暫無已啟動的 MCP 伺服器

# assistantEditMcpToolsCountTag
source: Tools: %1$@/%2$@
zh_hans: 工具: %1$@/%2$@
zh_hant: 工具: %1$@/%2$@

# assistantEditMemoryDialogHint
source: Enter memory content
zh_hans: 输入记忆内容
zh_hant: 輸入記憶內容

# assistantEditMemoryDialogTitle
source: Memory
zh_hans: 记忆
zh_hant: 記憶

# assistantEditMemoryEmpty
source: No memories yet
zh_hans: 暂无记忆
zh_hant: 暫無記憶

# assistantEditMemorySwitchDescription
source: Allow the assistant to create and use memories across chats.
zh_hans: 允许助手主动存储并在对话间引用用户相关信息
zh_hant: 允許助理主動儲存並在對話間引用使用者相關資訊

# assistantEditMemorySwitchTitle
source: Memory
zh_hans: 记忆
zh_hant: 記憶

# assistantEditMessageTemplateTitle
source: Message Template
zh_hans: 聊天内容模板
zh_hant: 聊天內容範本

# assistantEditModelUseGlobalDefault
source: Use global default
zh_hans: 使用全局默认
zh_hant: 使用全域預設

# assistantEditPageBasicTab
source: Basic
zh_hans: 基础设置
zh_hant: 基礎設定

# assistantEditPageCustomTab
source: Custom
zh_hans: 自定义请求
zh_hant: 自訂請求

# assistantEditPageMemoryTab
source: Memory
zh_hans: 记忆
zh_hant: 記憶

# assistantEditPageNotFound
source: Assistant not found
zh_hans: 助手不存在
zh_hant: 助理不存在

# assistantEditPagePromptsTab
source: Prompts
zh_hans: 提示词
zh_hant: 提示詞

# assistantEditPageQuickPhraseTab
source: Quick Phrase
zh_hans: 快捷短语
zh_hant: 快捷片語

# assistantEditPageRegexTab
source: Regex Replace
zh_hans: 正则替换
zh_hant: 正則替換

# assistantEditPageTitle
source: Assistant
zh_hans: 助手
zh_hant: 助理

# assistantEditParameterDisabled
source: Disabled (uses provider default)
zh_hans: 已关闭（使用服务商默认）
zh_hant: 已關閉（使用服務商預設）

# assistantEditParameterDisabled2
source: Disabled (no restrictions)
zh_hans: 已关闭（无限制）
zh_hant: 已關閉（無限制）

# assistantEditPresetAddAssistant
source: Add assistant preset
zh_hans: 添加预设助手信息
zh_hant: 新增預設助手訊息

# assistantEditPresetAddUser
source: Add user preset
zh_hans: 添加预设用户信息
zh_hant: 新增預設使用者訊息

# assistantEditPresetEditDialogTitle
source: Edit preset message
zh_hans: 编辑预设消息
zh_hant: 編輯預設訊息

# assistantEditPresetEmpty
source: No preset messages yet
zh_hans: 暂无预设消息
zh_hant: 暫無預設訊息

# assistantEditPresetInputHintAssistant
source: Enter assistant message…
zh_hans: 输入助手消息…
zh_hant: 輸入助手訊息…

# assistantEditPresetInputHintUser
source: Enter user message…
zh_hans: 输入用户消息…
zh_hant: 輸入使用者訊息…

# assistantEditPresetRoleAssistant
source: Assistant
zh_hans: 助手
zh_hant: 助手

# assistantEditPresetRoleUser
source: User
zh_hans: 用户
zh_hant: 使用者

# assistantEditPresetTitle
source: Preset conversation
zh_hans: 预设对话信息
zh_hant: 預設對話訊息

# assistantEditPreviewTitle
source: Preview
zh_hans: 预览
zh_hant: 預覽

# assistantEditQQAvatarDialogCancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# assistantEditQQAvatarDialogHint
source: Enter QQ number (5-12 digits)
zh_hans: 输入QQ号码（5-12位）
zh_hant: 輸入QQ號碼（5-12位）

# assistantEditQQAvatarDialogSave
source: Save
zh_hans: 保存
zh_hant: 儲存

# assistantEditQQAvatarDialogTitle
source: Import from QQ
zh_hans: 使用QQ头像
zh_hant: 使用QQ頭像

# assistantEditQQAvatarFailedMessage
source: Failed to fetch random QQ avatar. Please try again.
zh_hans: 获取随机QQ头像失败，请重试
zh_hant: 取得隨機QQ頭像失敗，請重試

# assistantEditQQAvatarRandomButton
source: Random One
zh_hans: 随机QQ
zh_hant: 隨機QQ

# assistantEditQuickPhraseDescription
source: Manage quick phrases for this assistant. Click the button below to add phrases.
zh_hans: 管理该助手的快捷短语。点击下方按钮添加或编辑短语。
zh_hant: 管理此助理的快捷片語。點擊下方按鈕以新增或編輯片語。

# assistantEditRecentChatsSummaryFrequencyCustomButton
source: Custom
zh_hans: 自定义
zh_hant: 自訂

# assistantEditRecentChatsSummaryFrequencyCustomDescription
source: Enter how many new messages should accumulate before refreshing the recent-chat summary.
zh_hans: 输入累计多少条新消息后再更新历史聊天摘要。
zh_hant: 輸入累計多少則新訊息後再更新歷史聊天摘要。

# assistantEditRecentChatsSummaryFrequencyCustomHint
source: Enter a number greater than 0
zh_hans: 请输入大于 0 的整数
zh_hant: 請輸入大於 0 的整數

# assistantEditRecentChatsSummaryFrequencyCustomInvalid
source: Please enter a whole number greater than 0
zh_hans: 请输入大于 0 的整数
zh_hant: 請輸入大於 0 的整數

# assistantEditRecentChatsSummaryFrequencyCustomLabel
source: New message count
zh_hans: 新消息条数
zh_hant: 新訊息數量

# assistantEditRecentChatsSummaryFrequencyCustomTitle
source: Custom Summary Frequency
zh_hans: 自定义摘要频率
zh_hant: 自訂摘要頻率

# assistantEditRecentChatsSummaryFrequencyDescription
source: Refresh recent-chat summaries after the selected number of new messages.
zh_hans: 累计达到所选条数的新消息后，会更新历史聊天摘要。
zh_hant: 累計達到所選條數的新訊息後，會更新歷史聊天摘要。

# assistantEditRecentChatsSummaryFrequencyOption
source: Every %lld
zh_hans: 每 %lld 条
zh_hant: 每 %lld 則

# assistantEditRecentChatsSummaryFrequencyTitle
source: Summary Refresh Frequency
zh_hans: 摘要更新频率
zh_hant: 摘要更新頻率

# assistantEditRecentChatsSwitchDescription
source: Include recent conversation titles to help with context.
zh_hans: 在新对话中引用最近的对话标题以增强上下文
zh_hant: 在新對話中引用最近的對話標題以增強上下文

# assistantEditRecentChatsSwitchTitle
source: Recent Chats Reference
zh_hans: 参考历史聊天记录
zh_hant: 參考歷史聊天記錄

# assistantEditRegexDescription
source: Create regex rules to rewrite or visually adjust user/assistant messages.
zh_hans: 为用户/助手消息配置正则规则，可修改或仅调整显示效果。
zh_hant: 為使用者/助理訊息配置正則規則，可修改或僅調整顯示效果。

# assistantEditSampleMessage
source: Hello there
zh_hans: 你好啊
zh_hant: 你好啊

# assistantEditSampleReply
source: Hello, how can I help you?
zh_hans: 你好，有什么我可以帮你的吗？
zh_hant: 你好，有什麼我可以幫你的嗎？

# assistantEditSampleUser
source: User
zh_hans: 用户
zh_hant: 使用者

# assistantEditStreamOutputDescription
source: Enable streaming responses
zh_hans: 是否启用消息的流式输出
zh_hant: 是否啟用訊息的串流輸出

# assistantEditStreamOutputTitle
source: Stream Output
zh_hans: 流式输出
zh_hant: 串流輸出

# assistantEditSystemPromptHint
source: Enter system prompt…
zh_hans: 输入系统提示词…
zh_hant: 輸入系統提示詞…

# assistantEditSystemPromptImportButton
source: Import file
zh_hans: 从文件导入
zh_hant: 從檔案匯入

# assistantEditSystemPromptImportEmpty
source: File is empty
zh_hans: 文件内容为空
zh_hant: 檔案內容為空

# assistantEditSystemPromptImportFailed
source: Failed to import file
zh_hans: 导入失败
zh_hant: 匯入失敗

# assistantEditSystemPromptImportSuccess
source: System prompt updated from file
zh_hans: 已从文件更新系统提示词
zh_hant: 已從檔案更新系統提示詞

# assistantEditSystemPromptTitle
source: System Prompt
zh_hans: 系统提示词
zh_hant: 系統提示詞

# assistantEditTemperatureDescription
source: Controls randomness, range 0–2
zh_hans: 控制输出的随机性，范围 0–2
zh_hant: 控制輸出的隨機性，範圍 0–2

# assistantEditTemperatureTitle
source: Temperature
zh_hans: 温度
zh_hant: 溫度

# assistantEditThinkingBudgetTitle
source: Thinking Budget
zh_hans: 思考预算
zh_hant: 思考預算

# assistantEditTopPDescription
source: Do not change unless you know what you are doing
zh_hans: 请不要修改此值，除非你知道自己在做什么
zh_hant: 請不要修改此值，除非你知道自己在做什麼

# assistantEditUseAssistantAvatarSubtitle
source: Use assistant avatar instead of model avatar
zh_hans: 在聊天中使用助手头像替代模型头像
zh_hant: 在聊天中使用助理頭像取代模型頭像

# assistantEditUseAssistantAvatarTitle
source: Use Assistant Avatar
zh_hans: 使用助手头像
zh_hant: 使用助理頭像

# assistantEditUseAssistantNameTitle
source: Use Assistant Name
zh_hans: 使用助手名字
zh_hant: 使用助理名字

# assistantEditVariableAssistantName
source: Assistant Name
zh_hans: 助手名称
zh_hant: 助理名稱

# assistantEditVariableBatteryLevel
source: Battery Level
zh_hans: 电池电量
zh_hant: 電池電量

# assistantEditVariableDate
source: Date
zh_hans: 日期
zh_hant: 日期

# assistantEditVariableDatetime
source: Datetime
zh_hans: 日期和时间
zh_hant: 日期和時間

# assistantEditVariableDeviceInfo
source: Device Info
zh_hans: 设备信息
zh_hant: 裝置資訊

# assistantEditVariableLocale
source: Locale
zh_hans: 语言环境
zh_hant: 語言環境

# assistantEditVariableMessage
source: Message
zh_hans: 内容
zh_hant: 內容

# assistantEditVariableModelId
source: Model ID
zh_hans: 模型ID
zh_hant: 模型ID

# assistantEditVariableModelName
source: Model Name
zh_hans: 模型名称
zh_hant: 模型名稱

# assistantEditVariableNickname
source: Nickname
zh_hans: 用户昵称
zh_hant: 使用者暱稱

# assistantEditVariableRole
source: Role
zh_hans: 角色
zh_hant: 角色

# assistantEditVariableSystemVersion
source: System Version
zh_hans: 系统版本
zh_hant: 系統版本

# assistantEditVariableTime
source: Time
zh_hans: 时间
zh_hant: 時間

# assistantEditVariableTimezone
source: Timezone
zh_hans: 时区
zh_hant: 時區

# assistantProviderDefaultAssistantName
source: Default Assistant
zh_hans: 默认助手
zh_hant: 預設助理

# assistantProviderNewAssistantName
source: New Assistant
zh_hans: 新助手
zh_hant: 新助理

# assistantProviderSampleAssistantName
source: Sample Assistant
zh_hans: 示例助手
zh_hant: 範例助理

# assistantProviderSampleAssistantSystemPrompt
source: You are %1$@, an AI assistant who gladly provides accurate and helpful assistance. The current time is %2$@, the device language is %3$@, timezone is %4$@, the user is using %5$@, version %6$@. If the user does not explicitly specify otherwise, please use the user's device language when replying.
zh_hans: 你是%1$@, 一个人工智能助手，乐意为用户提供准确，有益的帮助。现在时间是%2$@，用户设备语言为%3$@，时区为%4$@，用户正在使用%5$@，版本%6$@。如果用户没有明确说明，请使用用户设备语言进行回复。
zh_hant: 你是%1$@, 一個人工智慧助理，樂意為使用者提供準確，有益的幫助。現在時間是%2$@，使用者裝置語言為%3$@，時區為%4$@，使用者正在使用%5$@，版本%6$@。如果使用者沒有明確說明，請使用使用者裝置語言進行回覆。

# assistantRegexAddAction
source: Add
zh_hans: 添加
zh_hant: 新增

# assistantRegexAddTitle
source: Add Regex Rule
zh_hans: 添加正则规则
zh_hant: 新增正則規則

# assistantRegexCancelButton
source: Cancel
zh_hans: 取消
zh_hant: 取消

# assistantRegexDeleteButton
source: Delete
zh_hans: 删除
zh_hant: 刪除

# assistantRegexEditTitle
source: Edit Regex Rule
zh_hans: 编辑正则规则
zh_hant: 編輯正則規則

# assistantRegexInvalidPattern
source: Invalid regular expression
zh_hans: 正则表达式无效
zh_hant: 正則表達式無效

# assistantRegexNameLabel
source: Rule Name
zh_hans: 规则名称
zh_hant: 規則名稱

# assistantRegexPatternLabel
source: Regular Expression
zh_hans: 正则表达式
zh_hant: 正則表達式

# assistantRegexReplacementLabel
source: Replacement String
zh_hans: 替换字符串
zh_hant: 替換字串

# assistantRegexSaveAction
source: Save
zh_hans: 保存
zh_hant: 儲存

# assistantRegexScopeAssistant
source: Assistant
zh_hans: 助手
zh_hant: 助理

# assistantRegexScopeLabel
source: Affecting Scope
zh_hans: 影响范围
zh_hant: 影響範圍

# assistantRegexScopeReplaceOnly
source: Replace Only
zh_hans: 仅替换
zh_hant: 僅替換

# assistantRegexScopeUser
source: User
zh_hans: 用户
zh_hant: 使用者

# assistantRegexScopeVisualOnly
source: Visual Only
zh_hans: 仅视觉
zh_hant: 僅視覺

# assistantRegexUntitled
source: Untitled Rule
zh_hans: 未命名规则
zh_hant: 未命名規則

# assistantRegexValidationError
source: Please fill in the name, regex, and select at least one scope.
zh_hans: 请填写名称、正则表达式，并至少选择一个范围。
zh_hant: 請填寫名稱、正則表達式，並至少選擇一個範圍。

# assistantSettingsAddSheetCancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# assistantSettingsAddSheetHint
source: Enter a name
zh_hans: 输入助手名称
zh_hant: 輸入助理名稱

# assistantSettingsAddSheetSave
source: Save
zh_hans: 保存
zh_hant: 儲存

# assistantSettingsAddSheetTitle
source: Assistant Name
zh_hans: 助手名称
zh_hant: 助理名稱

# assistantSettingsAtLeastOneAssistantRequired
source: At least one assistant is required
zh_hans: 至少需要保留一个助手
zh_hant: 至少需要保留一個助理

# assistantSettingsCopyButton
source: Copy
zh_hans: 复制
zh_hant: 複製

# assistantSettingsCopySuccess
source: Assistant copied
zh_hans: 已复制助手
zh_hant: 已複製助理

# assistantSettingsCopySuffix
source: Copy
zh_hans: 副本
zh_hant: 副本

# assistantSettingsDefaultTag
source: Default
zh_hans: 默认
zh_hant: 預設

# assistantSettingsDeleteButton
source: Delete
zh_hans: 删除
zh_hant: 刪除

# assistantSettingsDeleteDialogCancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# assistantSettingsDeleteDialogConfirm
source: Delete
zh_hans: 删除
zh_hant: 刪除

# assistantSettingsDeleteDialogContent
source: Are you sure you want to delete this assistant? This action cannot be undone.
zh_hans: 确定要删除该助手吗？此操作不可撤销。
zh_hant: 確定要刪除該助理嗎？此操作不可撤銷。

# assistantSettingsDeleteDialogTitle
source: Delete Assistant
zh_hans: 删除助手
zh_hant: 刪除助理

# assistantSettingsEditButton
source: Edit
zh_hans: 编辑
zh_hant: 編輯

# assistantSettingsNoPromptPlaceholder
source: No prompt yet
zh_hans: 暂无提示词
zh_hant: 暫無提示詞

# assistantSettingsPageTitle
source: Assistant Settings
zh_hans: 助手设置
zh_hant: 助理設定

# assistantTagsClearTag
source: Clear Tag
zh_hans: 清除标签
zh_hant: 清除標籤

# assistantTagsContextMenuDeleteAssistant
source: Delete Assistant
zh_hans: 删除助手
zh_hant: 刪除助理

# assistantTagsContextMenuEditAssistant
source: Edit Assistant
zh_hans: 编辑助手
zh_hant: 編輯助理

# assistantTagsContextMenuManageTags
source: Manage Tags
zh_hans: 管理标签
zh_hant: 管理標籤

# assistantTagsCreateButton
source: Create
zh_hans: 创建
zh_hant: 建立

# assistantTagsCreateDialogCancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# assistantTagsCreateDialogOk
source: Create
zh_hans: 创建
zh_hant: 建立

# assistantTagsCreateDialogTitle
source: Create Tag
zh_hans: 创建标签
zh_hant: 建立標籤

# assistantTagsDeleteButton
source: Delete
zh_hans: 删除
zh_hant: 刪除

# assistantTagsDeleteConfirmCancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# assistantTagsDeleteConfirmContent
source: Are you sure you want to delete this tag?
zh_hans: 确定要删除该标签吗？
zh_hant: 確定要刪除該標籤嗎？

# assistantTagsDeleteConfirmOk
source: Delete
zh_hans: 删除
zh_hant: 刪除

# assistantTagsDeleteConfirmTitle
source: Delete Tag
zh_hans: 删除标签
zh_hant: 刪除標籤

# assistantTagsManageTitle
source: Manage Tags
zh_hans: 管理标签
zh_hant: 管理標籤

# assistantTagsNameHint
source: Tag name
zh_hans: 标签名称
zh_hant: 標籤名稱

# assistantTagsRenameButton
source: Rename
zh_hans: 重命名
zh_hant: 重新命名

# assistantTagsRenameDialogOk
source: Rename
zh_hans: 重命名
zh_hant: 重新命名

# assistantTagsRenameDialogTitle
source: Rename Tag
zh_hans: 重命名标签
zh_hant: 重新命名標籤

# backupPageBackup
source: Backup
zh_hans: 立即备份
zh_hant: 立即備份

# backupPageBackupManagement
source: Backup Management
zh_hans: 备份管理
zh_hant: 備份管理

# backupPageBackupNow
source: Backup Now
zh_hans: 立即备份
zh_hant: 立即備份

# backupPageBackupUploaded
source: Backup uploaded
zh_hans: 已上传备份
zh_hant: 已上傳備份

# backupPageCancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# backupPageChatsLabel
source: Chats
zh_hans: 聊天记录
zh_hant: 聊天記錄

# backupPageDeleteConfirmContent
source: Are you sure you want to delete remote backup "%@"? This action cannot be undone.
zh_hans: 确定要删除远程备份“%@”吗？此操作不可撤销。
zh_hant: 確定要刪除遠端備份「%@」嗎？此操作不可撤銷。

# backupPageDeleteConfirmTitle
source: Confirm Deletion
zh_hans: 确认删除
zh_hant: 確認刪除

# backupPageDeleteTooltip
source: Delete
zh_hans: 删除
zh_hant: 刪除

# backupPageExportToFile
source: Export to File
zh_hans: 导出为文件
zh_hant: 匯出為檔案

# backupPageExportToFileSubtitle
source: Export app data to a file
zh_hans: 导出APP数据为文件
zh_hant: 匯出APP資料為檔案

# backupPageExporting
source: Exporting...
zh_hans: 正在导出...
zh_hant: 正在匯出...

# backupPageFilesLabel
source: Files
zh_hans: 文件
zh_hant: 檔案

# backupPageImportBackupFile
source: Import Backup File
zh_hans: 备份文件导入
zh_hant: 備份檔案匯入

# backupPageImportBackupFileSubtitle
source: Import a local backup file
zh_hans: 导入本地备份文件
zh_hant: 匯入本機備份檔案

# backupPageImportExportTab
source: Import/Export
zh_hans: 导入和导出
zh_hant: 匯入和匯出

# backupPageImportFromChatbox
source: Import from Chatbox
zh_hans: 从 Chatbox 导入
zh_hant: 從 Chatbox 匯入

# backupPageImportFromCherryStudio
source: Import from Cherry Studio
zh_hans: 从 Cherry Studio 导入
zh_hant: 從 Cherry Studio 匯入

# backupPageImportFromOtherApps
source: Import from Other Apps
zh_hans: 从其他APP导入
zh_hant: 從其他APP匯入

# backupPageImportFromRikkaHub
source: Import from RikkaHub
zh_hans: 从 RikkaHub 导入
zh_hant: 從 RikkaHub 匯入

# backupPageLocalBackup
source: Local Backup
zh_hans: 本地备份
zh_hant: 本機備份

# backupPageMergeMode
source: Smart Merge
zh_hans: 智能合并
zh_hant: 智能合併

# backupPageMergeModeDescription
source: Add only non-existing data (intelligent deduplication)
zh_hans: 仅添加不存在的数据（智能去重）
zh_hant: 僅添加不存在的資料（智能去重）

# backupPageNoBackups
source: No backups
zh_hans: 暂无备份
zh_hant: 暫無備份

# backupPageNotSupportedYet
source: Not supported yet
zh_hans: 暂不支持
zh_hant: 暫不支援

# backupPageOK
source: OK
zh_hans: 好的
zh_hant: 好的

# backupPageOverwriteMode
source: Complete Overwrite
zh_hans: 完全覆盖
zh_hant: 完全覆蓋

# backupPageOverwriteModeDescription
source: Clear all local data and restore from backup
zh_hans: 清空本地所有数据后恢复
zh_hant: 清空本地所有資料後恢復

# backupPagePassword
source: Password
zh_hans: 密码
zh_hant: 密碼

# backupPagePath
source: Path
zh_hans: 路径
zh_hant: 路徑

# backupPageRemoteBackups
source: Remote Backups
zh_hans: 远端备份
zh_hant: 遠端備份

# backupPageRestartContent
source: Restore completed. Please restart the app.
zh_hans: 恢复完成，需要重启以完全生效。
zh_hant: 還原完成，需要重啟以完全生效。

# backupPageRestartRequired
source: Restart Required
zh_hans: 需要重启应用
zh_hant: 需要重啟應用程式

# backupPageRestore
source: Restore
zh_hans: 恢复
zh_hant: 還原

# backupPageRestoreTooltip
source: Restore
zh_hans: 恢复
zh_hant: 還原

# backupPageS3AccessKeyId
source: Access Key ID
zh_hans: 访问密钥 ID

# backupPageS3Backup
source: S3 Backup
zh_hans: S3 备份
zh_hant: S3 備份

# backupPageS3Endpoint
source: Endpoint
zh_hans: 端点
zh_hant: Endpoint（地址）

# backupPageS3PathStyle
source: Path-style addressing
zh_hans: 路径风格（Path-style）
zh_hant: 路徑風格（Path-style）

# backupPageS3Prefix
source: Prefix
zh_hans: 前缀（目录）
zh_hant: 前綴（目錄）

# backupPageS3Region
source: Region
zh_hans: 区域
zh_hant: Region（區域）

# backupPageS3SecretAccessKey
source: Secret Access Key
zh_hans: 秘密访问密钥

# backupPageS3ServerSettings
source: S3 Settings
zh_hans: S3 服务器设置
zh_hant: S3 伺服器設定

# backupPageS3SessionToken
source: Session Token (Optional)
zh_hans: Session Token（可选）
zh_hant: Session Token（可選）

# backupPageSave
source: Save
zh_hans: 保存
zh_hant: 儲存

# backupPageSelectImportMode
source: Select Import Mode
zh_hans: 选择导入模式
zh_hant: 選擇匯入模式
